In [0]:
import numpy as np
import pandas as pd
from pandas import Series, DataFrame

In [0]:
ser1 = Series(np.arange(3), index=['a', 'b', 'c'])

In [4]:
ser1

a    0
b    1
c    2
dtype: int64

In [5]:
# indexを削除する
ser1.drop('b')

a    0
c    2
dtype: int64

In [6]:
ser1 # 元のSeriesから削除されたわけではない

a    0
b    1
c    2
dtype: int64

In [0]:
dframe1 = DataFrame(np.arange(9).reshape((3, 3)), index=['SF', 'LA', 'NY'], columns=['pop', 'size', 'year'])

In [10]:
dframe1

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [11]:
# indexを指定して行を削除する
dframe1.drop('LA')

    pop  size  year
SF    0     1     2
NY    6     7     8

In [12]:
dframe1 # 元のDataFrameから削除されたわけではない

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [13]:
# 列を削除する
dframe1.drop('year', axis=1)

    pop  size
SF    0     1
LA    3     4
NY    6     7

In [14]:
dframe1 # 元のDataFrameから削除されたわけではない

    pop  size  year
SF    0     1     2
LA    3     4     5
NY    6     7     8

In [0]:
del dframe1['year'] # これだと元のDataFrameから列が削除されてしまう

In [16]:
dframe1

    pop  size
SF    0     1
LA    3     4
NY    6     7